In [1]:
import pandas as pd
import sqlite3

In [9]:
create_table = """
CREATE TABLE student_scores
(Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL)
;"""

In [10]:
executeSQL = sqlite3.connect('database.db')
executeSQL.execute(create_table) #create our table
executeSQL.commit()

In [11]:
#prepare our query
query = executeSQL.execute('select * from student_scores')

In [12]:
resultset = query.fetchall()
resultset

[]

In [13]:
#insert data (id, name, math, science)
insert = [(1, 'Jack', 90, 90), (2, 'Jill', 95, 95)]

In [15]:
insert_statement = "Insert into student_scores values(?, ?, ?, ?)"
executeSQL.executemany(insert_statement, insert)
executeSQL.commit()

In [17]:
query = executeSQL.execute('select * from student_scores')
resultset = query.fetchall()
resultset

[(1, 'Jack', 90.0, 90.0), (2, 'Jill', 95.0, 95.0)]

In [26]:
#transfer to dataframe
student_scores = pd.DataFrame(resultset, columns=zip(query.description))
student_scores

,"((Id, None, None, None, None, None, None),)","((Name, None, None, None, None, None, None),)","((Math, None, None, None, None, None, None),)","((Science, None, None, None, None, None, None),)"
0,1,Jack,90.0,90.0
1,2,Jill,95.0,95.0